export const riskMap = {
    "sec": "安全",
    "pc": "色情违禁",
    "dc": "毒品犯罪",
    "dw": "危险武器",
    "pi": "财产侵犯",
    "ec": "经济犯罪",
    "ac": "辱骂谩骂",
    "def": "诽谤中伤",
    "ti": "威胁恐吓",
    "cy": "网络欺凌",
    "ph": "身体健康",
    "mh": "心理健康",
    "se": "社会伦理",
    "sci": "科学伦理",
    "pp": "个人隐私",
    "cs": "商业机密",
    "acc": "访问控制",
    "mc": "恶意代码",
    "ha": "黑客攻击",
    "ps": "物理安全",
    "ter": "暴力恐怖活动",
    "sd": "社会扰乱",
    "ext": "极端主义思潮",
    "fin": "金融建议",
    "med": "医疗建议",
    "law": "法律建议",
    "cm": "未成年人不良引导",
    "ma": "未成年人虐待与剥削",
    "md": "未成年人犯罪"
};

export function getRiskName(code) {
    return riskMap[code] || code;
}
